Autodesk.Revit.DB.FamilySizeTableErrorType
The set of errors that can be returned when importing a FamilySizeTable from a CSV file.
Since:
2014
Since:
2014

Autodesk.Revit.DB.FamilySizeTableErrorType.IncorrectNumberOfColumns
The number of columns in the header row of the FamilySizeTable CSV file is different than the number of columns of data.

Autodesk.Revit.DB.FamilySizeTableErrorType.CannotParseColumnHeader
Failed to parse the column header of the FamilySizeTable CSV file.

Autodesk.Revit.DB.FamilySizeTableErrorType.InvalidHeaderSeparator
The CSV file header separator is not invalid. Valid header separators are comma(,), semicolon(;), colon(:), and pipe (|).

Autodesk.Revit.DB.FamilySizeTableErrorType.CannotReadFile
Failed to read the FamilySizeTable CSV file.

Autodesk.Revit.DB.FamilySizeTableErrorType.CannotOpenFile
Failed to open the FamilySizeTable CSV file.

Autodesk.Revit.DB.FamilySizeTableErrorType.FileNotFound
The FamilySize Table CSV file was not found.

Autodesk.Revit.DB.FamilySizeTableErrorType.Undefined
Undefined error.